In [1]:
import numpy as np
import pandas as pd #불러오는데 오래 걸림

In [9]:
# Series 생성
obj = pd.Series([-1, 3, 6, 8, 9], index=["a", "b", "c", "d", "e"])
obj

a   -1
b    3
c    6
d    8
e    9
dtype: int64

In [8]:
#Dictionary를 이용한 Series 생성
dict = {"seoul" : 1000, "pusan" : 2000, "suwon" : 3000}
s = pd.Series(dict)
s.name = "price_per_region"
s.index.name ="region"
s

region
pusan    2000
seoul    1000
suwon    3000
Name: price_per_region, dtype: int64

In [10]:
dict = {"seoul" : 1000, "pusan" : 2000, "suwon" : 3000}
s = pd.Series(dict)

In [43]:
# DataFrame
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])
df.values

#df.index.name = "sNum"
#df.columns.name = "sInfo"
df[["names", "year"]]

df["grade"] = ["A", "B", "C", "A", "A"]
df["double_points"] = df["points"] * 2
df["hi_points"] = df["points"] > 2.5
del df["grade"]
df

df.drop("hi_points", axis=1)
# 1차원에서는 0 : 오른쪽 방향
# 2차원에서는 0, 1 : 0은 행방향 1은 열방향
# 3차원에서는 0, 1, 2 : 0은 깊이, 1은 행방향, 2는 열방향

       year names  points  double_points
one    2015   kim     1.5            3.0
two    2016   kim     2.7            5.4
three  2017   lee     1.3            2.6
four   2015  park     2.6            5.2
five   2015   lee     3.0            6.0

In [53]:
# DataFrame
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])

# row indexing
#df[0:2]
df.loc["one":"three", "names":"grade"]

      names  points grade
one     kim     1.5   NaN
two     kim     2.7   NaN
three   lee     1.3   NaN

In [56]:
# DataFrame
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])

df.drop("one")

       year names  points grade
two    2016   kim     2.7   NaN
three  2017   lee     1.3   NaN
four   2015  park     2.6   NaN
five   2015   lee     3.0   NaN

In [61]:
#iloc

df.iloc[0, 0]

2015

In [69]:
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])

# MASK
df.loc[df["points"] > 2.0, ["names", "points"]]

df.loc[df["names"] == "kim",["names", "points"]]

df.loc[(df["year"] >= 2015) & (df["points"] > 2.0)]

      year names  points grade
two   2016   kim     2.7   NaN
four  2015  park     2.6   NaN
five  2015   lee     3.0   NaN

In [95]:
df = pd.DataFrame(np.random.randn(6, 4))
df.columns = ["A", "B", "C", "D"]
df.index = pd.date_range("20190101", periods=6)
df["E"] = [3.5, np.nan, 2.0, np.nan, 1.7, np.nan]

# Nan이 있는 행 모두 삭제
df.dropna(how="any")

# Nan을 대체
df.fillna(0)

# 각 셀의 Nan 상태 체크
df.isnull()

                A      B      C      D      E
2019-01-01  False  False  False  False  False
2019-01-02  False  False  False  False   True
2019-01-03  False  False  False  False  False
2019-01-04  False  False  False  False   True
2019-01-05  False  False  False  False  False
2019-01-06  False  False  False  False   True

In [102]:
data = [[2.0, np.nan],
       [7.3, -3.1],
       [np.nan, np.nan],
       [0.55, -2.6]]

df = pd.DataFrame(data,
                 columns=["one", "two"],
                 index=["a", "b", "c", "d"])

#합
df.sum(axis=1)

df["two"].sum()  #특정열

df.loc["b"].sum() #특정행

4.199999999999999

In [136]:
data = [[2.0, np.nan],
       [7.3, -3.1],
       [np.nan, np.nan],
       [0.55, -2.6]]

df = pd.DataFrame(data,
                 columns=["one", "two"],
                 index=["a", "b", "c", "d"])

# 결측값을 다른값으로 대체
# one의 nan은 one의 평균으로
# two의 nan은 two의 최소값으로

df1 = df.fillna(0)

one_mean = df["one"].mean()
two_sum = df["two"].sum()


df["one"] = df["one"].fillna(value=df.mean(axis=0)["one"])
df["two"] = df["two"].fillna(value=df.min(axis=0)["two"])

df

        one  two
a  2.000000 -3.1
b  7.300000 -3.1
c  3.283333 -3.1
d  0.550000 -2.6